{"module": "keras.src.engine.functional", "class_name": "Functional", "config": {"name": "model", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1024, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "wave_input"}, "registered_name": null, "name": "wave_input", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [5], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 1024, 3]}, "name": "conv1d", "inbound_nodes": [[["wave_input", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_1", "trainable": true, "dtype": "float32", "filters": 52, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 1020, 64]}, "name": "conv1d_1", "inbound_nodes": [[["conv1d", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 1020, 52]}, "name": "conv1d_2", "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "add", "trainable": true, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 1020, 64], [null, 1020, 64]]}, "name": "add", "inbound_nodes": [[["conv1d_2", 0, 0, {}], ["conv1d", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "build_config": {"input_shape": [null, 1020, 64]}, "name": "re_lu", "inbound_nodes": [[["add", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 1020, 64]}, "name": "max_pooling1d", "inbound_nodes": [[["re_lu", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 510, 64]}, "name": "batch_normalization", "inbound_nodes": [[["max_pooling1d", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_3", "trainable": true, "dtype": "float32", "filters": 52, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 510, 64]}, "name": "conv1d_3", "inbound_nodes": [[["batch_normalization", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_4", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 510, 52]}, "name": "conv1d_4", "inbound_nodes": [[["conv1d_3", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "add_1", "trainable": true, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 510, 64], [null, 510, 64]]}, "name": "add_1", "inbound_nodes": [[["conv1d_4", 0, 0, {}], ["batch_normalization", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_1", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "build_config": {"input_shape": [null, 510, 64]}, "name": "re_lu_1", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_1", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 510, 64]}, "name": "max_pooling1d_1", "inbound_nodes": [[["re_lu_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 255, 64]}, "name": "batch_normalization_1", "inbound_nodes": [[["max_pooling1d_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_5", "trainable": true, "dtype": "float32", "filters": 52, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 255, 64]}, "name": "conv1d_5", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_6", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 255, 52]}, "name": "conv1d_6", "inbound_nodes": [[["conv1d_5", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "add_2", "trainable": true, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 255, 64], [null, 255, 64]]}, "name": "add_2", "inbound_nodes": [[["conv1d_6", 0, 0, {}], ["batch_normalization_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_2", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "build_config": {"input_shape": [null, 255, 64]}, "name": "re_lu_2", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_2", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 255, 64]}, "name": "max_pooling1d_2", "inbound_nodes": [[["re_lu_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 127, 64]}, "name": "batch_normalization_2", "inbound_nodes": [[["max_pooling1d_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "cam_layer", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 127, 64]}, "name": "cam_layer", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Multiply", "config": {"name": "multiply", "trainable": true, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 127, 64], [null, 127, 1]]}, "name": "multiply", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}], ["cam_layer", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 127, 64]}, "name": "dense", "inbound_nodes": [[["multiply", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.math.add", "trainable": true, "dtype": "float32", "function": "math.add"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, 127, 128]}, "name": "tf.math.add", "inbound_nodes": [["dense", 0, 0, {"y": [[[-0.006318368017673492, 0.039322543889284134, -0.035993121564388275, -0.033069148659706116, 0.02121385559439659, 0.030780207365751266, -0.009372759610414505, 0.012502919882535934, -0.004398129880428314, -0.032452404499053955, -0.009671401232481003, 0.027866650372743607, -0.0012122765183448792, -0.04836639389395714, 0.006595410406589508, -0.024179507046937943, 0.0012631900608539581, 0.030158404260873795, 0.0354863740503788, -0.0008401758968830109, 0.016140412539243698, -0.00027179718017578125, -0.007732369005680084, 2.1122395992279053e-05, -0.04171910136938095, -0.019737089052796364, 0.010149657726287842, 0.044048454612493515, -0.045570384711027145, 0.02331390604376793, 0.011201776564121246, 0.029442738741636276, -0.044011618942022324, -0.0038375258445739746, -0.00325687974691391, 0.04885662719607353, -0.03499634191393852, 0.018594589084386826, 0.03560379520058632, 0.009068619459867477, -0.01760118082165718, -0.025925053283572197, 0.0037559159100055695, 0.018589530140161514, -0.046976614743471146, -0.04698380455374718, 0.00029833242297172546, 0.007277738302946091, 0.0164383165538311, 0.04670638218522072, 0.009023617953062057, -0.009936023503541946, -0.013836659491062164, 0.0017618536949157715, 0.03929780796170235, -0.022967470809817314, -0.0042461976408958435, 0.006673693656921387, -0.0035187825560569763, -0.04642583057284355, -0.04035691171884537, -0.03182204067707062, 0.04889979586005211, 0.0342755950987339, -0.013516925275325775, 0.048353079706430435, -0.04590853676199913, 0.021046306937932968, -0.04129251092672348, -0.02320241928100586, -0.011176548898220062, -0.004456173628568649, -0.04683483764529228, 0.037714507430791855, 0.028162885457277298, 0.039095472544431686, -0.007821716368198395, 0.016050327569246292, 0.012462176382541656, 0.010588444769382477, 0.022391226142644882, 0.04892348125576973, -0.0023670904338359833, 0.04800984635949135, 0.04850732162594795, -0.01284121349453926, 0.0018507838249206543, 0.00643085315823555, 0.03762951120734215, 0.042021479457616806, -0.0148666612803936, 0.0327841155230999, 0.002205587923526764, 0.008983016014099121, -0.009522806853055954, 0.004976939409971237, -0.04130816459655762, -0.02025163173675537, -0.049145400524139404, 0.03418675437569618, 0.023287203162908554, 0.007162213325500488, -0.03139476850628853, -0.03809598833322525, 0.011465691030025482, 0.013543669134378433, 0.022450421005487442, -0.04574963077902794, -0.04300987720489502, 0.018819216638803482, -0.022651493549346924, 0.00011742115020751953, -4.617124795913696e-05, 0.047735247761011124, 0.040560755878686905, 0.03786642476916313, -0.013649571686983109, -0.024577641859650612, 0.03139059618115425, -0.04788827896118164, 0.015894699841737747, -0.014706265181303024, 0.021411065012216568, -0.04707369953393936, 0.007980357855558395, -0.03211360052227974, -0.011333178728818893, 0.03417176380753517], [0.044350627809762955, -0.026111114770174026, -0.02432347647845745, -0.027429426088929176, -0.04711573198437691, -0.03338053077459335, 0.004588164389133453, -0.02032308652997017, -0.039813946932554245, 0.042672883719205856, -0.034847378730773926, 0.010290063917636871, 0.006669510155916214, -0.004508055746555328, 0.0032408609986305237, -0.042015232145786285, 0.008550416678190231, -0.005574263632297516, 0.04192081466317177, 0.038100991398096085, -0.04631544277071953, 0.026593316346406937, -0.01663120836019516, -0.04615255817770958, -0.029064619913697243, -0.0027885325253009796, -0.03514738008379936, 0.0439533106982708, -0.04496505483984947, 0.008161582052707672, 0.0054749734699726105, -0.01894545555114746, 0.047316934913396835, 0.022690776735544205, 0.010364510118961334, -0.022107316181063652, 0.0011805519461631775, 0.048332247883081436, 0.04179565981030464, -0.0367044098675251, 0.004416070878505707, 0.03889118507504463, -0.02445540390908718, -0.006673358380794525, -0.017873812466859818, -0.00619284063577652, 0.03779369965195656, 0.003959871828556061, -0.018084120005369186, 0.008949290961027145, -0.009244214743375778, 0.013072285801172256, -0.011315323412418365, -0.013396479189395905, -0.01941402070224285, -0.02180769480764866, -0.046937551349401474, -0.00657276064157486, 0.02975500002503395, 0.030914250761270523, 0.03986163064837456, -0.042276907712221146, -0.026745950803160667, 0.014635276049375534, -0.013566076755523682, -0.008793246001005173, -0.04590275511145592, 0.044721100479364395, 0.027736235409975052, 0.018535975366830826, -0.039143551141023636, 0.002690829336643219, 0.028848376125097275, 0.015302609652280807, -0.018925344571471214, 0.02187773957848549, 0.04846671596169472, -0.044456709176301956, -0.02786031924188137, -0.0021166205406188965, -0.009207762777805328, -0.020134402438998222, -0.02981560304760933, 0.008025027811527252, 0.02336224541068077, -0.02755880355834961, 0.024498607963323593, -0.023721039295196533, -0.0353093147277832, -0.019308006390929222, 0.021912161260843277, 0.0159575454890728, -0.03907794877886772, 0.012274324893951416, 0.04873282089829445, -0.04529467970132828, -0.024402905255556107, 0.007734466344118118, -0.017883550375699997, -0.013547349721193314, 0.0013070926070213318, -0.03255945444107056, -0.01744009181857109, -0.021501338109374046, 0.025436270982027054, -0.02404022216796875, -0.03729972988367081, 0.03777608647942543, -0.038667239248752594, -0.03870191425085068, 0.04874953255057335, -0.04422372579574585, -0.0039654262363910675, -0.024866938591003418, 0.028091851621866226, -0.03213068097829819, 0.023627471178770065, -0.03640240430831909, 0.010991416871547699, 0.008247554302215576, 0.030165497213602066, 0.010126899927854538, -0.005986608564853668, -0.022426653653383255, 0.015026334673166275, 0.021654877811670303, -0.03764753416180611, -0.0052169449627399445], [-0.0014233589172363281, 0.005340646952390671, 0.024429116398096085, 0.042871858924627304, 0.017880570143461227, -0.04900997877120972, -0.01491779088973999, -0.046198904514312744, -0.013421524316072464, 0.03254934772849083, -0.04395638778805733, -0.04263782501220703, -0.04159102588891983, 0.0391787625849247, 0.0038733482360839844, 0.04598522558808327, 0.035509493201971054, -0.02567584626376629, -0.04192543029785156, -0.006909262388944626, -0.015662431716918945, 0.013715196400880814, 0.026660416275262833, 0.02279675379395485, -0.0011461488902568817, -0.024935532361268997, 0.008097279816865921, 0.032719600945711136, 0.04726925864815712, -0.011363349854946136, -0.006028283387422562, -0.017905592918395996, 0.034372035413980484, 0.00020681694149971008, 0.0065125711262226105, -0.028258001431822777, 0.03353443369269371, -0.0262779351323843, -0.03549252822995186, 0.036553073674440384, 0.0011794455349445343, -0.004418410360813141, -0.0012811645865440369, 0.046941909939050674, 0.007015597075223923, -0.0037213675677776337, -0.034899793565273285, -0.013304434716701508, -0.037613965570926666, 0.01800156757235527, 0.0016679055988788605, -0.021534932777285576, -0.015874065458774567, -0.02588428370654583, 0.01212538406252861, 0.03866387531161308, -0.03397219255566597, 0.03978515788912773, -0.04152987152338028, 0.03827837482094765, -0.04387170076370239, 0.03085510805249214, 0.04221481457352638, 0.00647662952542305, 0.04615402594208717, 0.046013664454221725, 0.04169956222176552, 0.0440460704267025, -0.03397907316684723, -0.04018862172961235, -0.04340187460184097, -0.009779226034879684, 0.03779640421271324, 0.03155391290783882, 0.015593301504850388, -0.0267404206097126, -0.040443360805511475, 0.0325329564511776, 0.014852967113256454, 0.008951365947723389, -0.045507874339818954, -0.02087029255926609, -0.012385118752717972, 0.012880746275186539, 0.04881776496767998, -0.012232087552547455, -0.04808635637164116, -0.013658452779054642, -0.02739359252154827, -0.0200003981590271, -0.010196246206760406, 0.04602440819144249, -0.0003061071038246155, 0.020723197609186172, -0.008703052997589111, -0.028460025787353516, 0.021644238382577896, 0.04337134584784508, -0.0205244068056345, 0.03734077140688896, -0.01993042230606079, -0.03188358619809151, -0.03868822008371353, -0.029422475025057793, -0.0458296537399292, 0.02261941507458687, 0.02658151462674141, 0.01921870931982994, -0.04453609138727188, 0.00454479455947876, -0.014333605766296387, -0.010892592370510101, -0.0007859356701374054, -0.04984578117728233, -0.0037666931748390198, 0.0013473033905029297, 0.0240333192050457, 0.044066037982702255, 0.001391671597957611, 0.030011843889951706, 0.04092444106936455, -0.025739526376128197, -0.021359849721193314, -0.02162611484527588, -0.02378079853951931, -0.017188549041748047, -0.04442639276385307, -0.03758261352777481], [0.004715513437986374, -0.0037192702293395996, 0.013795901089906693, 0.026089753955602646, 0.0396050326526165, 0.047889914363622665, 0.021737422794103622, -0.009694613516330719, 0.030222643166780472, -0.034879423677921295, 0.025164250284433365, 0.023096729069948196, 0.007580995559692383, 0.007558036595582962, -0.041473936289548874, 0.0015512704849243164, 0.03479761257767677, 0.022456277161836624, -0.010942280292510986, 0.03372306004166603, 0.04911443218588829, 0.0027426593005657196, -0.01627201959490776, -0.047085799276828766, -0.026129091158509254, -0.0003526918590068817, 0.021378222852945328, -0.011915694922208786, -0.03826751559972763, 0.03551690652966499, -0.009656179696321487, 0.047806475311517715, -0.038285862654447556, -0.04935852438211441, 0.022798191756010056, 0.024754371494054794, 0.03853757306933403, 0.011680565774440765, -0.009773731231689453, 0.03352648392319679, 0.01605922356247902, -0.042921245098114014, 0.015543188899755478, -0.04963618516921997, 0.04779226705431938, -0.04021026939153671, -0.03800243139266968, -0.013598538935184479, -0.023925816640257835, -0.042470622807741165, -0.034697867929935455, -0.01805102825164795, -0.04038287326693535, 0.009097147732973099, 0.038633350282907486, -0.017050839960575104, 0.027312230318784714, 0.04713565483689308, 0.038349512964487076, 0.04314989969134331, -0.020067228004336357, 0.04298892989754677, -0.02195183001458645, 0.025532234460115433, 0.046651508659124374, 0.016974877566099167, -0.042001474648714066, 0.04581925645470619, -0.016671299934387207, 0.03507784381508827, 0.0002871975302696228, 0.04634581878781319, 0.0467338003218174, -0.02478267066180706, 0.018244240432977676, 0.029409829527139664, -0.014841116964817047, 0.01229942962527275, 0.01197371631860733, 0.03822729364037514, 0.02363169565796852, -0.02821352519094944, -0.02716987207531929, 0.006203196942806244, -0.02307227812707424, 0.006515681743621826, -0.03330160677433014, -0.002545606344938278, 0.016358379274606705, 0.022888842970132828, 0.0019439682364463806, 0.02149336412549019, 0.04885590448975563, 0.03699178621172905, 0.036245014518499374, 0.03243938460946083, -0.00561368465423584, 0.008832704275846481, -0.04716069623827934, -0.03970761224627495, 0.01935683563351631, -0.04571651294827461, 0.032995495945215225, -0.03704734891653061, -0.03869898244738579, -0.01267000287771225, 0.006837081164121628, -0.04429781436920166, 0.04141582176089287, 0.0361507423222065, -0.01860140636563301, 0.024963561445474625, 0.018847335129976273, 0.009676981717348099, -0.030161429196596146, 0.016566108912229538, -0.014246750622987747, 0.04318756237626076, -0.028442824259400368, -0.005821608006954193, -0.005521465092897415, -0.02136610820889473, 0.004384495317935944, -0.03483825922012329, 0.04566904529929161, 9.384006261825562e-05, 0.03851271793246269, 0.03324464336037636], [0.005790434777736664, 0.022996727377176285, -0.026255059987306595, 0.016406062990427017, 0.002733863890171051, 0.0012788884341716766, 0.005098223686218262, -0.01582183688879013, -0.04500913619995117, -0.017185308039188385, -0.009357236325740814, -0.006332684308290482, -0.04832998663187027, 0.042380835860967636, 0.03441474214196205, -0.010877955704927444, -0.0014276988804340363, -0.04764110967516899, 0.04441032186150551, 0.04676083102822304, -0.048274338245391846, 0.048450615257024765, -0.00937674194574356, 0.03144020214676857, 0.026924971491098404, -0.020969880744814873, 0.025340821593999863, -0.00498894602060318, -0.03948410600423813, -0.003010950982570648, -0.042017124593257904, 0.047185931354761124, -0.025893807411193848, 0.028377417474985123, -0.04427067190408707, 0.0081094391644001, -0.031026208773255348, -0.04743385314941406, -0.013730525970458984, 0.035366203635931015, 0.029149916023015976, 0.011814497411251068, -0.01223602145910263, -0.03572122007608414, 0.02390429750084877, -0.005989599972963333, 0.043780017644166946, -0.0014360323548316956, 0.010671008378267288, -0.002603936940431595, -0.0026635155081748962, 0.026462148874998093, -0.044502198696136475, 0.00968407467007637, 0.013034109026193619, 0.03919224813580513, -0.0329037681221962, 0.045828673988580704, -0.04481704160571098, 0.039827074855566025, 0.03312050178647041, 0.01483757421374321, 0.049178097397089005, -0.015295840799808502, -0.030644763261079788, -0.004848837852478027, 0.0179673470556736, -0.030826807022094727, 0.01135794073343277, -0.03833860158920288, 0.010495413094758987, 0.009370483458042145, -0.01811704784631729, 0.037191834300756454, -0.005207382142543793, 0.0466802753508091, 0.013558808714151382, -0.04652510955929756, -0.0010815858840942383, 0.01910010352730751, -0.045862939208745956, 0.0007625333964824677, 0.017034102231264114, 0.027017701417207718, -0.03057398833334446, -0.0011348016560077667, 0.04479687288403511, 0.0034100189805030823, -0.010878335684537888, 0.04051050916314125, 0.03749630227684975, -0.03683660179376602, -0.017965782433748245, -0.010412883013486862, -0.026851976290345192, 0.03584475442767143, 0.02212364599108696, -0.04116873815655708, 0.012689892202615738, -0.0439201258122921, -0.014089155942201614, -0.00178440660238266, 0.046406518667936325, 0.019591066986322403, -0.020705735310912132, 0.034303274005651474, 0.013861250132322311, 0.01924511417746544, 0.008718598634004593, -0.011090494692325592, -0.018784498795866966, -0.011850785464048386, 0.013920877128839493, 0.03738142177462578, -0.047638703137636185, 0.04859192296862602, -0.038308870047330856, 0.04523337259888649, 0.012237824499607086, -0.012280214577913284, 0.016334321349859238, 0.00334017351269722, -0.033110931515693665, 0.03210354223847389, 0.01586088165640831, 0.024611424654722214, 0.0177084319293499, 0.005321752279996872], [-0.021041059866547585, 0.0067184679210186005, -0.04138510301709175, -0.04536623880267143, -0.0226104985922575, 0.010684359818696976, 0.03255525603890419, -0.029192103073000908, -0.01820923015475273, 0.009769998490810394, -0.04290555790066719, 0.01806248351931572, 0.03829273208975792, -0.006254326552152634, 0.017865005880594254, 0.03260571137070656, 0.0017634741961956024, 0.04026779904961586, 0.015772473067045212, -0.007811032235622406, 0.025655221194028854, -0.03342399746179581, 0.019494805485010147, 0.005491994321346283, -0.03382493555545807, 0.03770405426621437, 0.03853053227066994, 0.0025871507823467255, -0.045204151421785355, -0.0303642638027668, 0.013148192316293716, 0.0030708424746990204, 0.030107665807008743, 0.00883396714925766, -0.02334878407418728, 0.005350567400455475, -0.04668013006448746, 0.028818678110837936, 0.04196492210030556, 0.04859716817736626, 0.043454792350530624, -0.03702269867062569, 0.02382207289338112, 0.047326039522886276, -0.001680515706539154, -0.013137422502040863, -0.0177445188164711, 0.012583915144205093, -0.04182785749435425, 0.03141769394278526, 0.003435097634792328, 0.04937520995736122, 0.012576136738061905, -0.009882606565952301, 0.0155937559902668, -0.017234861850738525, -0.04834325239062309, -0.03338468074798584, 0.008716784417629242, 0.016053471714258194, -0.045658744871616364, -0.01396263763308525, -0.010290253907442093, -0.006274104118347168, -0.047162819653749466, -0.03457241132855415, 0.016618479043245316, 0.016355644911527634, -0.040834832936525345, -0.014466501772403717, -0.007208608090877533, 0.012633610516786575, 0.03843251243233681, 0.04623769596219063, 0.04463561996817589, -0.0075727105140686035, 0.03827109560370445, -0.0026821494102478027, -0.047005545347929, 0.034565579146146774, -0.04233897849917412, 0.04758815839886665, 0.0014188885688781738, -0.016050778329372406, 0.03591516241431236, 0.005617715418338776, 0.032931093126535416, 0.009396087378263474, -0.019116485491394997, 0.025529053062200546, 0.032535064965486526, 0.014890041202306747, 0.03637225553393364, 0.0266069658100605, -0.04008055850863457, -0.018925834447145462, -0.028851032257080078, 0.0022352226078510284, -0.002996481955051422, 0.04762638732790947, 0.0020962953567504883, 0.04946479573845863, 0.028471898287534714, -0.019029129296541214, -0.016489852219820023, -0.04599957540631294, 0.02379307523369789, -0.0426449291408062, -0.04582098871469498, -0.0497882254421711, 0.03738598898053169, 0.0010375604033470154, 0.012775849550962448, -0.0028291717171669006, 0.0299905426800251, -0.01298832893371582, -0.02584216557443142, 0.03600502386689186, -0.027289045974612236, -0.028198635205626488, -0.027408087626099586, -0.02969592809677124, -0.04798873886466026, -0.047100603580474854, 0.008928634226322174, 0.012319527566432953, -0.0021747946739196777, -0.046381689608097076], [-0.002204645425081253, 0.027848567813634872, 0.047688212245702744, -0.006105970591306686, -0.005258716642856598, -0.040419530123472214, -0.006245851516723633, 0.015283871442079544, 0.010350991040468216, 0.011599063873291016, 0.018770065158605576, -0.037366606295108795, 0.03839552775025368, -0.037718988955020905, -0.034869421273469925, -0.029518140479922295, 0.013162139803171158, -0.023178160190582275, 0.032441768795251846, 0.0075826868414878845, 0.03790004178881645, -0.04663611575961113, -0.0005156509578227997, -0.003800630569458008, 0.029820013791322708, -0.014887295663356781, -0.018790066242218018, 0.03652188554406166, 0.006579242646694183, -0.016506683081388474, -2.0444393157958984e-05, 0.03189380094408989, -0.046924103051424026, 0.04822603240609169, 0.02596532180905342, -0.017560698091983795, 0.033435795456171036, -0.042071662843227386, 0.008692406117916107, 2.3733824491500854e-05, 0.030388567596673965, 0.046553004533052444, 0.03144456073641777, -0.021780824288725853, -0.028378749266266823, -0.03255349397659302, 0.040987614542245865, -0.024424850940704346, -0.0267659779638052, -0.043978501111269, 0.02187957987189293, -0.009356867522001266, 0.010437201708555222, 0.03595695272088051, 0.028789568692445755, -0.012257982045412064, -0.03906317800283432, 0.0001641400158405304, -0.006006825715303421, -0.00799577310681343, 0.01315612718462944, 0.009914912283420563, -0.01511438935995102, -0.023605525493621826, 0.035117242485284805, 0.0383387915790081, -0.02397526614367962, 0.02509934827685356, 0.03366908058524132, 0.03781619295477867, 0.0017341971397399902, 0.04450264945626259, 0.023556184023618698, 0.03864282742142677, 0.049410056322813034, -0.01868293434381485, 0.03498322144150734, -0.01084955781698227, -0.017859280109405518, -0.023715008050203323, 0.03999624028801918, -0.04925115033984184, -0.04813730716705322, -0.020640671253204346, 0.045136597007513046, 0.02638540044426918, -0.02078881300985813, 0.012163005769252777, -0.0367165207862854, -0.014520704746246338, 0.0386861227452755, 0.03976481035351753, -4.938989877700806e-05, -0.04822264984250069, 0.006037913262844086, -0.03463144227862358, 0.014255378395318985, -0.027102326974272728, -0.04026435688138008, -0.004273463040590286, 0.03825162723660469, 0.03409448638558388, 0.03756313398480415, 0.009454142302274704, -0.029715240001678467, -0.0342155322432518, -0.03508198261260986, -0.0486736074090004, 0.04501667246222496, 0.041046928614377975, -0.00013729184865951538, 0.04514715448021889, -0.019159376621246338, 0.005632422864437103, -0.004073299467563629, 0.007539879530668259, -0.039596546441316605, -0.027337325736880302, 0.04239031299948692, 0.0027037635445594788, 0.02173837646842003, 0.025122854858636856, -0.018542803823947906, 0.04085332527756691, 0.005793403834104538, -0.042477142065763474, -0.03729848936200142, -0.013364516198635101], [0.03816645219922066, -0.04473254829645157, -0.010008703917264938, -0.01751004531979561, 0.028850439935922623, -0.0334961898624897, -0.006813574582338333, -0.008800506591796875, -0.03230605274438858, 0.00961773470044136, -0.02154417149722576, 0.04989631101489067, 0.048456836491823196, 0.00725550577044487, 0.020589005202054977, 0.003367174416780472, 0.0008310675621032715, 0.025538694113492966, 0.023878145962953568, -0.004510544240474701, -0.017475474625825882, 0.024905238300561905, -0.017709732055664062, 0.01828836277127266, -0.034467555582523346, 0.04341914877295494, -0.0014608614146709442, -0.020674049854278564, -0.016265999525785446, 0.04161970689892769, 0.016711238771677017, -0.014049351215362549, -0.033874548971652985, -0.022586524486541748, -0.004178524017333984, 0.012359581887722015, -0.016760993748903275, -0.010407626628875732, -0.004284955561161041, 0.013676594942808151, 0.01616344228386879, 0.002908371388912201, 0.030656885355710983, 0.03936518356204033, -0.04630016162991524, 0.03097539022564888, -0.046193815767765045, 0.014875318855047226, 0.034362029284238815, -0.028266405686736107, 0.01858152076601982, -0.011945031583309174, 0.04105867072939873, -0.009300649166107178, 0.04500154033303261, 0.0029535070061683655, -0.002148248255252838, -0.049965012818574905, -0.016429878771305084, -0.0007623210549354553, -0.03206273168325424, 0.015908408910036087, -0.018332205712795258, -0.027325619012117386, -0.00859135389328003, -0.03520221635699272, -0.0022013671696186066, 0.03175387158989906, 0.04387184605002403, 0.02916501834988594, -0.0106315016746521, 0.007682632654905319, -0.010621000081300735, 0.0270376093685627, -0.047313142567873, 0.024766813963651657, 0.040160249918699265, 0.015478421002626419, -0.026579393073916435, -0.021817315369844437, 0.015342999249696732, -0.0281920675188303, 0.0158388651907444, -0.04444592073559761, -0.044358279556035995, -0.02410503663122654, -0.03578120470046997, 0.03362454101443291, -0.04362928867340088, 0.030133698135614395, 0.01912226900458336, -0.024054408073425293, 0.011149752885103226, 0.028669152408838272, -0.0027622468769550323, 0.03655767813324928, -0.041385602205991745, -0.01928786002099514, -0.016875922679901123, 0.023501764982938766, 0.021056916564702988, -0.027719033882021904, 0.014963973313570023, 0.040474358946084976, 0.012565340846776962, 0.03223958984017372, 0.018266823142766953, 0.022080015391111374, -0.0142243392765522, -0.021809805184602737, 0.0008222237229347229, -0.016603730618953705, 0.007430173456668854, 0.04734701290726662, 0.0012149326503276825, 0.007818173617124557, 0.03482300415635109, 0.04366422817111015, 0.006829500198364258, 0.039649490267038345, 0.004679381847381592, 0.03378200903534889, -0.018250025808811188, 0.017206642776727676, 0.005867384374141693, 0.029356803745031357, 0.001033533364534378, 0.007140088826417923], [0.04972575977444649, -0.029451966285705566, -0.03682676702737808, -0.0317717082798481, -0.02099638059735298, -0.04214862734079361, -0.006951473653316498, 0.008418012410402298, -0.047560740262269974, -0.037991106510162354, -0.03210186958312988, 0.004788555204868317, 0.01588595286011696, -0.013713967055082321, 0.004436135292053223, 0.039453569799661636, 0.002365030348300934, -0.0236040111631155, -0.0386338010430336, -0.0003166310489177704, 0.0443500392138958, 0.04938511922955513, -0.04412415251135826, -0.04917563125491142, 0.044278983026742935, 0.028797652572393417, -0.01126408576965332, 0.011593114584684372, -0.006543576717376709, 0.0002512224018573761, 0.020289529114961624, 0.006157767027616501, -0.04640777036547661, 0.04011661931872368, 0.017905566841363907, 0.02069336548447609, -0.019175827503204346, -0.0017219893634319305, 0.040943633764982224, 0.03933200612664223, -0.03049597702920437, 0.00021474435925483704, -0.03519165515899658, 0.0051516517996788025, 0.023730922490358353, -0.026556968688964844, -0.0005157701671123505, -0.047189246863126755, -0.02475431002676487, 0.025901105254888535, 0.02987818792462349, 0.017918679863214493, -0.015084970742464066, 0.04092887416481972, 0.02918262407183647, 0.021744046360254288, 0.04898769035935402, -0.023608136922121048, 0.03976589813828468, -0.0431983582675457, -0.028046298772096634, -0.005327533930540085, -0.029083598405122757, 0.04171634837985039, -0.0321400910615921, 0.01746242120862007, -0.03359862416982651, 0.04589691385626793, -0.04818390682339668, 0.03169608488678932, -0.029014145955443382, -0.03185749053955078, 0.009797848761081696, 0.036766041070222855, -0.031615614891052246, 0.03392528370022774, 0.03718206658959389, 0.030478868633508682, -0.019197726622223854, 0.020806778222322464, 0.016748633235692978, -0.00899200513958931, -0.027846766635775566, 0.024123970419168472, -0.009382378309965134, -0.03211122751235962, -0.029727553948760033, 0.02824750915169716, -0.03312408924102783, 0.009490467607975006, -0.03817262500524521, -0.023402178660035133, 0.03494158759713173, 0.04569964483380318, 0.01288234069943428, -0.034320056438446045, -0.041548848152160645, -0.025411833077669144, -0.02368021011352539, -0.017899535596370697, 0.0452180840075016, -0.018398605287075043, 0.014720510691404343, 0.04997513070702553, -0.03172900527715683, -0.015324987471103668, -0.018745888024568558, 0.04641330614686012, -0.03864560276269913, -0.015882492065429688, -0.0016515366733074188, 0.0060939788818359375, -0.021529698744416237, -0.0010033957660198212, -0.03550199419260025, 0.03851516172289848, -0.012303091585636139, -0.024862218648195267, 0.04472101852297783, 0.04079613462090492, 0.006399728357791901, -0.027586912736296654, 0.034642066806554794, -2.1208077669143677e-05, 0.045228470116853714, 0.045989904552698135, -0.0441988967359066, -0.018115483224391937], [-0.009773053228855133, 0.015606891363859177, -0.04097578674554825, 0.006668053567409515, -0.001361798495054245, 0.03640276566147804, -0.049222517758607864, 0.03732499107718468, 0.047012995928525925, 0.03268548473715782, 0.028437722474336624, 0.0029099807143211365, -0.0009186752140522003, 0.03487788513302803, -0.019773101434111595, 0.007186494767665863, -0.04295278713107109, -0.04212081432342529, 0.04415537044405937, 0.0045260898768901825, 0.021845582872629166, -0.024760235100984573, -0.009827803820371628, -0.03348658233880997, 0.041909072548151016, 0.006281159818172455, -0.029543746262788773, 0.04113056883215904, 0.01789829507470131, 0.005122624337673187, 0.004801332950592041, 0.02545147016644478, 0.023617956787347794, -0.00457531213760376, -0.03374575451016426, -0.039061106741428375, -0.02415841817855835, 0.034656573086977005, 0.006358016282320023, -0.03554349020123482, -0.04569659382104874, -0.027364587411284447, -0.033728860318660736, -0.042264293879270554, 0.038352254778146744, 0.03408480063080788, -0.02308177947998047, 0.008719764649868011, 0.036810580641031265, 0.030521992594003677, 0.04986113682389259, -0.03159694746136665, -0.008567333221435547, 0.005966901779174805, -0.012894798070192337, 0.00456836074590683, -0.03851819038391113, 0.02161964401602745, -0.039363108575344086, -0.015664946287870407, 0.03599002584815025, 0.03702601417899132, 0.037928927689790726, -0.010550461709499359, 0.041672732681035995, 0.03585446998476982, 0.014216054230928421, -0.02634148672223091, 0.04501071199774742, -0.018887698650360107, -0.018196415156126022, -0.0006101243197917938, -0.03432124853134155, -0.0357627272605896, -0.006734777241945267, 0.03858398273587227, 0.031072106212377548, -0.03236447647213936, 0.0252419151365757, 0.01726757362484932, 0.03246137127280235, -0.008427418768405914, 0.048996422439813614, -0.00885540246963501, 0.0024737007915973663, -0.04211214929819107, -0.021172726526856422, 0.0009311437606811523, 0.03593466058373451, 0.02284691110253334, 0.02400198206305504, -0.0015593543648719788, -0.042538631707429886, -0.015452217310667038, 0.03157998248934746, 0.035604026168584824, -0.04882488399744034, 0.005958974361419678, -0.039729319512844086, -0.017222367227077484, -0.020761167630553246, -0.03630058839917183, 0.01855551078915596, 0.030437324196100235, -0.01175309345126152, -0.010128367692232132, 0.0016593337059020996, -0.007827650755643845, -0.015634380280971527, 0.020687725394964218, -0.01806432008743286, -0.005271542817354202, -0.00981283187866211, -0.030416036024689674, -0.04185861349105835, 0.030684862285852432, -0.03942849487066269, -0.041587818413972855, 0.028745796531438828, 0.02688014879822731, -0.012221790850162506, -0.04940063878893852, 0.022521819919347763, -0.046850550919771194, -0.005978010594844818, 0.0019582994282245636, -0.0467708595097065, 0.016300562769174576], [-0.015949346125125885, -0.003982316702604294, -0.033847857266664505, 0.020013485103845596, -0.009647168219089508, -0.031177615746855736, 0.029854383319616318, -0.03621695190668106, -0.030935024842619896, -0.02952714078128338, 0.028914418071508408, 0.04717898741364479, -0.02414843998849392, 0.02997150644659996, -0.02030041255056858, -0.03917950391769409, -0.026412546634674072, 0.034661147743463516, -0.010038923472166061, 0.008062444627285004, 0.036166559904813766, 0.011019837111234665, -0.046389926224946976, 0.024243902415037155, 0.03141343966126442, -0.019634319469332695, -0.036095164716243744, -0.01638488844037056, -0.02547844685614109, -0.04305204376578331, 0.03299626335501671, 0.045371782034635544, 0.014889907091856003, 0.027650561183691025, -0.049990881234407425, -0.002710796892642975, -0.0043984055519104, 0.02640901878476143, -0.03538874536752701, -0.04447894170880318, 0.04861270263791084, 0.003281116485595703, -0.03695490211248398, -0.0187264084815979, -0.0027557238936424255, -0.04430197551846504, 0.02682279422879219, 0.005874931812286377, -0.03900542110204697, 0.0018134713172912598, -0.030235910788178444, -0.04723343998193741, 0.0013358816504478455, -0.02764754369854927, 0.0023631229996681213, -0.013633143156766891, 0.020736541599035263, -0.005163215100765228, -0.04085693508386612, 0.04954416677355766, 0.04547394439578056, -0.03907430171966553, 0.010815165936946869, 0.02362142875790596, 0.016034234315156937, -0.03161933273077011, 0.006476413458585739, 0.0027790777385234833, 0.032030556350946426, -0.012914717197418213, -0.009873438626527786, 0.04183981195092201, -0.02862447500228882, -0.006158076226711273, -0.04901483282446861, -0.04670082405209541, -0.01446685940027237, 0.04453437402844429, 0.016955342143774033, 0.04881579056382179, 0.04184362664818764, 0.003938246518373489, -0.046596039086580276, 0.012071192264556885, -0.022700130939483643, -0.037139616906642914, -0.007313750684261322, -0.008334994316101074, 0.03031337633728981, 0.044572483748197556, -0.04016781970858574, -0.0065415725111961365, -0.023147596046328545, 0.043960560113191605, 0.035478245466947556, 0.011816609650850296, -0.0027526505291461945, -0.04252913221716881, -0.022779060527682304, 0.023198354989290237, -0.013691842555999756, -0.008360553532838821, -0.025794565677642822, -0.01766784116625786, -0.043449461460113525, 0.009971119463443756, 0.01686859503388405, -0.04045645147562027, -0.025751186534762383, -0.04019331932067871, 0.04629340395331383, 0.04395034536719322, -0.03348872810602188, 0.03205403313040733, 0.04359699413180351, 0.047150615602731705, -0.03122924640774727, -0.0015982761979103088, -0.027756785973906517, -0.022584665566682816, 0.018559906631708145, 0.012610223144292831, -0.03864103555679321, -0.0006917007267475128, 0.01072995737195015, -0.044219281524419785, 0.0324443019926548, -0.026836836710572243], [-0.044132720679044724, 0.0368478037416935, 0.012691903859376907, -0.01912001334130764, -0.021090269088745117, 0.045902397483587265, 0.010676693171262741, -0.03361499309539795, 0.0007983334362506866, -0.03197091817855835, -0.01764702796936035, 0.006325900554656982, 0.032000113278627396, -0.020194804295897484, -0.03235544264316559, 0.026685144752264023, 0.03434193506836891, -0.035823166370391846, 0.0022361502051353455, -0.030987871810793877, 0.04251325502991676, 0.012859251350164413, -0.023253226652741432, -0.035927046090364456, -0.003385782241821289, -0.02788393571972847, 0.013930309563875198, 0.02455395832657814, -0.04891526699066162, -0.02522946707904339, -0.04046182706952095, -0.047489941120147705, 0.04349769279360771, 0.005934488028287888, 0.0028582103550434113, -0.008363176137208939, 0.007661677896976471, 0.0305384062230587, -0.002678297460079193, 0.028279315680265427, 0.00554811954498291, -0.012771476060152054, 0.01697676256299019, 0.02060437574982643, 0.04941953346133232, 0.011272765696048737, -0.048222530633211136, -0.02265547588467598, 0.007121313363313675, -0.0005597472190856934, 0.026794005185365677, -0.03700164705514908, -0.03021913766860962, 0.03340263292193413, -0.048004209995269775, 0.03805169090628624, -0.04216867685317993, -0.028442133218050003, -0.04835722595453262, -0.018948031589388847, 0.017822828143835068, 0.001605737954378128, 0.048961613327264786, -0.004933882504701614, 0.036564890295267105, 0.04634005203843117, 0.04585123434662819, 5.167722702026367e-05, -0.020833730697631836, -0.01535419374704361, 0.03571179136633873, -0.01941891945898533, 0.024897921830415726, -0.027860498055815697, 0.02011798694729805, -0.02299410104751587, -0.04452759027481079, -0.034720279276371, 0.019642140716314316, 0.012010287493467331, -0.04943341016769409, -0.012909077107906342, -0.001036476343870163, 0.04071439430117607, -0.045440830290317535, 0.006819546222686768, -0.009305011481046677, 0.04803596809506416, 0.014510761946439743, 0.004545450210571289, 0.009138774126768112, -0.04934659227728844, 0.019391048699617386, 0.024299073964357376, 0.028029654175043106, -0.04665609821677208, 0.0095590241253376, -0.020987510681152344, 0.03848731890320778, -0.03389594703912735, -0.007612694054841995, 0.02241387590765953, -0.04255043342709541, 0.027569804340600967, 0.028678778558969498, 0.03797329589724541, 0.04083829000592232, 0.001567114144563675, -0.04004979133605957, 0.04892474785447121, -0.04443589597940445, 0.023324940353631973, -0.009596146643161774, -0.030829859897494316, -2.538040280342102e-05, -0.015772081911563873, -0.026875901967287064, 0.04127063974738121, 0.025838147848844528, 0.04802391305565834, -0.0367656946182251, -0.034281693398952484, -0.011607848107814789, 0.04890502616763115, -0.03924800083041191, -3.014877438545227e-05, -0.007678963243961334, 0.046331774443387985], [0.012420415878295898, -0.002268753945827484, -0.03389643505215645, 0.026994135230779648, 0.034783411771059036, -0.012776006013154984, -0.009335018694400787, -0.02214035950601101, -0.04512866958975792, 0.0485030896961689, 0.03966689482331276, -0.04932453855872154, -0.025958729907870293, 0.04112971946597099, -0.046774543821811676, 0.03996234014630318, -0.022123361006379128, 0.003129422664642334, 0.03351866081357002, -0.03418245166540146, -0.036793552339076996, -0.04677659273147583, 0.025995444506406784, 0.022643301635980606, -0.012685514986515045, -0.01011364534497261, -0.0381251685321331, -0.020703529939055443, -0.03272547572851181, 0.0063073039054870605, -0.048416007310152054, -0.011438500136137009, -0.03869374841451645, 0.009168125689029694, -0.006434164941310883, -0.022246230393648148, 0.024626385420560837, -0.0064643509685993195, -0.010913599282503128, 0.04724612459540367, -0.04089722782373428, 0.038186583667993546, 0.002016007900238037, -0.01521974802017212, 0.012474574148654938, -0.018669866025447845, -0.042874157428741455, -0.03627414628863335, -0.03994889184832573, 0.04314097389578819, 0.005415044724941254, 0.002164997160434723, -0.009363733232021332, -0.009950302541255951, 0.04102541133761406, -0.004733216017484665, -0.042090583592653275, 0.041814614087343216, -0.0024123415350914, -0.010792743414640427, -0.02638096921145916, -0.013036977499723434, 0.0412922166287899, -0.041851114481687546, -0.009052775800228119, -0.029081476852297783, -0.002548716962337494, -0.010872125625610352, 0.027387741953134537, 0.044610489159822464, 0.04664268717169762, 0.030727457255125046, 0.03733260557055473, 0.049393679946660995, 0.0006327740848064423, -0.003503810614347458, 0.03620209917426109, 