{"module": "keras.src.engine.functional", "class_name": "Functional", "config": {"name": "model", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1024, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "wave_input"}, "registered_name": null, "name": "wave_input", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d", "trainable": true, "dtype": "float32", "filters": 44, "kernel_size": [9], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 1024, 3]}, "name": "conv1d", "inbound_nodes": [[["wave_input", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_1", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 1016, 44]}, "name": "conv1d_1", "inbound_nodes": [[["conv1d", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_2", "trainable": true, "dtype": "float32", "filters": 44, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 1016, 40]}, "name": "conv1d_2", "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "add", "trainable": true, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 1016, 44], [null, 1016, 44]]}, "name": "add", "inbound_nodes": [[["conv1d_2", 0, 0, {}], ["conv1d", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "build_config": {"input_shape": [null, 1016, 44]}, "name": "re_lu", "inbound_nodes": [[["add", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 1016, 44]}, "name": "max_pooling1d", "inbound_nodes": [[["re_lu", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 508, 44]}, "name": "batch_normalization", "inbound_nodes": [[["max_pooling1d", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_3", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 508, 44]}, "name": "conv1d_3", "inbound_nodes": [[["batch_normalization", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_4", "trainable": true, "dtype": "float32", "filters": 44, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 508, 40]}, "name": "conv1d_4", "inbound_nodes": [[["conv1d_3", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "add_1", "trainable": true, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 508, 44], [null, 508, 44]]}, "name": "add_1", "inbound_nodes": [[["conv1d_4", 0, 0, {}], ["batch_normalization", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_1", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "build_config": {"input_shape": [null, 508, 44]}, "name": "re_lu_1", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_1", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 508, 44]}, "name": "max_pooling1d_1", "inbound_nodes": [[["re_lu_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 254, 44]}, "name": "batch_normalization_1", "inbound_nodes": [[["max_pooling1d_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_5", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 254, 44]}, "name": "conv1d_5", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_6", "trainable": true, "dtype": "float32", "filters": 44, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 254, 40]}, "name": "conv1d_6", "inbound_nodes": [[["conv1d_5", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "add_2", "trainable": true, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 254, 44], [null, 254, 44]]}, "name": "add_2", "inbound_nodes": [[["conv1d_6", 0, 0, {}], ["batch_normalization_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_2", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "build_config": {"input_shape": [null, 254, 44]}, "name": "re_lu_2", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_2", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 254, 44]}, "name": "max_pooling1d_2", "inbound_nodes": [[["re_lu_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 127, 44]}, "name": "batch_normalization_2", "inbound_nodes": [[["max_pooling1d_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "cam_layer", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 127, 44]}, "name": "cam_layer", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Multiply", "config": {"name": "multiply", "trainable": true, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 127, 44], [null, 127, 1]]}, "name": "multiply", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}], ["cam_layer", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 127, 44]}, "name": "dense", "inbound_nodes": [[["multiply", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.math.add", "trainable": true, "dtype": "float32", "function": "math.add"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, 127, 128]}, "name": "tf.math.add", "inbound_nodes": [["dense", 0, 0, {"y": [[[-0.046680986881256104, 0.04152730479836464, 0.0031870603561401367, -0.04697718843817711, -0.04739344120025635, 0.00652240589261055, 0.04814399406313896, 0.049906957894563675, 0.01720057800412178, 0.009090401232242584, 0.03565681353211403, 0.03169316425919533, -0.000347185879945755, -0.023051440715789795, -0.013634096831083298, -0.020090652629733086, 0.012262068688869476, -0.04265496879816055, 0.0010334476828575134, -0.024004388600587845, 0.048444714397192, 0.003535330295562744, -0.01933995448052883, -0.048364486545324326, 0.04298282042145729, -0.03549335151910782, 0.020355354994535446, 0.041532959789037704, 0.010606348514556885, -0.034867752343416214, 0.02820665016770363, -0.01976531744003296, -0.0447799451649189, 0.010980628430843353, 0.023266304284334183, -0.030798494815826416, 0.015943918377161026, 0.03889712318778038, -0.030449187383055687, 0.022840190678834915, 0.008409477770328522, -0.040583886206150055, 0.035217348486185074, 0.016799811273813248, -0.032615914940834045, -0.01400851085782051, 0.034695815294981, 0.047997843474149704, -0.010461021214723587, 0.025195572525262833, -0.020093942061066628, -0.00784909725189209, -0.007063843309879303, -0.010873891413211823, -0.004786394536495209, 0.016830597072839737, -0.02499687671661377, 0.02251717820763588, -0.040441740304231644, -0.035562168806791306, -0.003980457782745361, -0.010418832302093506, -0.03896836191415787, -0.013997197151184082, 0.026021409779787064, 0.023770619183778763, 0.015216592699289322, -0.04257326200604439, -0.04729877784848213, 0.014255214482545853, 0.04664827510714531, 0.020404968410730362, -0.027965951710939407, 0.04712137207388878, -0.0021367892622947693, -0.03688541799783707, -0.0035828128457069397, -0.027776135131716728, 0.023480776697397232, 0.024010691791772842, 0.01359051838517189, -0.0359458327293396, -0.04939765855669975, -0.0489889495074749, -0.04245007038116455, -0.02545027807354927, -0.044367995113134384, -0.00047791004180908203, 0.029042091220617294, -0.01488969475030899, -0.027706801891326904, 0.029745247215032578, -0.011332355439662933, -0.030578315258026123, 0.009199034422636032, 0.02432037517428398, 0.02686736360192299, 0.007199369370937347, 0.046913351863622665, 0.02718270942568779, 0.046780992299318314, -0.021638095378875732, 0.00443040207028389, -0.02397310733795166, -0.009989500045776367, 0.011019386351108551, 0.03358903154730797, -0.00728834792971611, -0.00023625046014785767, 0.03552905097603798, 0.03556045517325401, -0.0029809102416038513, -0.007778681814670563, 0.045851755887269974, 0.010656941682100296, -0.008674312382936478, 0.039846789091825485, 0.003345705568790436, -0.024864686653017998, 0.045125070959329605, -0.03649066761136055, 0.042699385434389114, 0.041532646864652634, -0.025760460644960403, 0.0035799257457256317, -0.009508013725280762, -0.041803278028964996, -0.02944009378552437], [0.02378850057721138, 0.03447486087679863, -0.03441651910543442, 0.047982681542634964, -0.04069582372903824, 0.021513137966394424, -0.01592925935983658, -0.0164252407848835, -0.02386254072189331, -4.447624087333679e-05, -0.016955625265836716, -0.04258810356259346, -0.022124623879790306, -0.005773521959781647, -0.028536105528473854, -0.0027900338172912598, 0.0076020583510398865, -0.011199187487363815, -0.010824393481016159, -0.012279771268367767, 0.03999121114611626, 0.027297649532556534, 0.0459202416241169, -0.0022661685943603516, 0.016271080821752548, -0.0026828162372112274, 0.017966460436582565, -0.023277854546904564, 0.015613619238138199, -0.04395949840545654, -0.04880732297897339, 0.03445159271359444, 0.021628830581903458, 0.026003550738096237, 0.03136831894516945, -0.008474968373775482, -0.02679838053882122, -0.03032900206744671, -0.0365791916847229, -0.01090247556567192, 0.022328976541757584, 0.018158044666051865, 0.009388111531734467, 0.01476217433810234, -0.017561696469783783, 0.0014459602534770966, -0.010716952383518219, -0.02290555275976658, 0.03806103393435478, -0.01047908142209053, 0.017961811274290085, 0.034811247140169144, -0.04185052961111069, -0.03757471963763237, 0.0206429623067379, 0.035565342754125595, 0.0290650837123394, 0.03760881349444389, 0.004579626023769379, 0.048708152025938034, 0.04243462160229683, 0.036574531346559525, -0.014543987810611725, -0.04461390897631645, 0.017509344965219498, 0.01731269434094429, -0.04515580087900162, -0.024027252569794655, 0.032873060554265976, 0.02769608423113823, -3.701448440551758e-05, 0.029701005667448044, 0.021996501833200455, -0.0421566478908062, 0.030383434146642685, 0.005823276937007904, -0.03428002446889877, -0.0372944250702858, -0.01198122650384903, 0.014074813574552536, 0.02620847150683403, -0.00512087345123291, 0.03252821043133736, -0.038371551781892776, 0.038937103003263474, -0.006920468062162399, -0.028528619557619095, -0.04950256273150444, -0.03758601099252701, -0.04984116554260254, -0.0326504111289978, 0.043454814702272415, 0.03068152442574501, 0.046475399285554886, -0.03799108415842056, -0.036881424486637115, 0.004388879984617233, -0.0026993639767169952, -0.03366722911596298, -0.02115865983068943, 0.015352580696344376, 0.03654098883271217, 0.00748906284570694, -0.036788713186979294, 0.015911664813756943, -0.002411164343357086, -0.005095124244689941, -0.024600600823760033, 0.029657874256372452, -0.03953897953033447, -0.010959945619106293, -0.032290175557136536, 0.041989292949438095, 0.024204377084970474, -0.03967677429318428, -0.04675483703613281, 0.005457747727632523, -0.04862872511148453, -0.03680194541811943, -0.03288154676556587, 0.028841447085142136, 0.0028460025787353516, -0.02546306885778904, 0.015088770538568497, 0.04488750919699669, 0.008547484874725342, -0.0007068142294883728, -0.041512202471494675], [-0.045798685401678085, -0.04272036626935005, 0.03675336018204689, -0.0427166111767292, 0.0030866265296936035, 0.04072049632668495, -0.007173992693424225, 0.025757085531949997, -0.04058128595352173, -0.04458944872021675, 0.003317214548587799, -0.018799280747771263, -0.0319097638130188, 0.043218400329351425, -0.025197256356477737, 0.005595304071903229, -0.04485621675848961, 0.00325017049908638, 0.03795981779694557, 0.002149619162082672, 0.03202042356133461, 0.016855251044034958, 0.0434361957013607, 0.008501041680574417, -0.000133465975522995, -0.03444482013583183, -0.028475631028413773, -0.03608423471450806, -0.030659783631563187, -0.04637938737869263, 0.02429218217730522, 0.0025027617812156677, 0.0045871250331401825, 0.010626863688230515, 0.017344143241643906, -0.04717433452606201, 0.014012519270181656, -0.03831666707992554, -0.012453772127628326, -0.019109642133116722, -0.041331470012664795, 0.009928345680236816, -0.029567575082182884, -0.0061130039393901825, 0.0001813545823097229, 0.0028664954006671906, -0.023101557046175003, -0.019665563479065895, -0.0006843693554401398, -0.031888581812381744, -0.014938164502382278, 0.013910684734582901, 0.03901105001568794, -0.0490286611020565, 0.04651162400841713, -0.03539501503109932, 0.04813864454627037, -0.036740146577358246, -0.012033797800540924, 0.02909158542752266, 0.007044423371553421, -0.013464212417602539, 0.010816574096679688, -0.02334778383374214, -0.031169606372714043, -0.027153480798006058, -0.01291590929031372, 0.025140170007944107, -0.0038964375853538513, -0.008512306958436966, -0.01448838785290718, -0.0208585262298584, -0.04709810018539429, 0.020661640912294388, -0.03839578479528427, 0.025642458349466324, 0.047951485961675644, -0.008875109255313873, -0.030557751655578613, 0.00693817064166069, -0.0293157696723938, -0.010748207569122314, -0.04972897842526436, -0.020562266930937767, -0.0013948455452919006, 0.03502379730343819, -0.0065336450934410095, -0.03054257668554783, -0.04564782604575157, 0.02789522334933281, -0.03920898586511612, 0.03045779839158058, -0.023472487926483154, -0.04442489147186279, 0.019344281405210495, 0.029894676059484482, -0.03341259807348251, 0.003833673894405365, 0.011907853186130524, -0.04906433820724487, 0.029734719544649124, 0.03883110359311104, 0.022504422813653946, 0.012998048216104507, 0.031597767025232315, 0.018760982900857925, 0.02235874906182289, 0.044924188405275345, -0.009047627449035645, -0.0036807768046855927, -0.026336515322327614, 0.01565464958548546, -0.026961183175444603, 0.04734477028250694, 0.016386572271585464, 0.03822575882077217, -0.03826038911938667, -0.04815319925546646, 0.029676828533411026, -0.016297828406095505, -0.0012625232338905334, 0.021852266043424606, -0.017932940274477005, 0.031302835792303085, -0.03647080808877945, 0.017954077571630478, -0.025449777022004128, -0.024260569363832474], [0.03622472658753395, 0.0034270063042640686, -0.027195727452635765, 0.0013591758906841278, -0.003013741225004196, 0.015457142144441605, -0.007469486445188522, 0.03836393728852272, -0.003122292459011078, 0.036690082401037216, -0.0237310528755188, 0.011951912194490433, 0.038879502564668655, 0.005272317677736282, -0.04863636568188667, -0.02219449356198311, -0.018682025372982025, 0.03222992643713951, -0.02589247189462185, 0.02559170499444008, 0.01616464927792549, -0.024559080600738525, -0.044275619089603424, -0.04769287258386612, 0.001963496208190918, -0.013949356973171234, 0.019504044204950333, -0.04470336437225342, 0.03326580300927162, -0.01714801788330078, -0.04373905807733536, 0.018283341079950333, -0.03469172865152359, 0.029352929443120956, -0.03218289464712143, -0.012796483933925629, -0.0018528476357460022, -0.0415179505944252, 0.04552512243390083, 0.03569154813885689, -0.020528925582766533, -0.007906783372163773, -0.04334450885653496, 0.03459348902106285, 0.005964744836091995, -0.045467983931303024, -0.03345634788274765, 0.012495230883359909, 0.022172417491674423, -0.029658306390047073, -0.020243585109710693, 0.030814874917268753, 0.046787891536951065, 0.025701437145471573, 0.049685005098581314, 0.0027262791991233826, 0.005306899547576904, -0.03038172796368599, -0.03614690154790878, -0.024968553334474564, 0.03509969636797905, -0.0018114224076271057, 0.044633571058511734, 0.01745576038956642, 0.043040681630373, -0.01723318174481392, -0.003642786294221878, -0.04170557111501694, -0.046498965471982956, -0.03513570874929428, -0.014841817319393158, -0.027402246370911598, -0.01095203310251236, 0.027544226497411728, 0.005257703363895416, -0.0381321907043457, -0.020320678129792213, -0.03441249206662178, 0.045435499399900436, 0.04964536800980568, 0.02445206418633461, -0.047638680785894394, 0.040262963622808456, 0.009816300123929977, 0.02092767134308815, 0.015773270279169083, -0.02800927124917507, 0.021546032279729843, -0.011291109025478363, -0.04766188934445381, 0.04444947466254234, 0.007052242755889893, -0.023635221645236015, 0.047513339668512344, -0.018850434571504593, 0.033033255487680435, -0.020607197657227516, 0.022242043167352676, 0.002833046019077301, 0.00640781968832016, 0.0304088331758976, 0.028253186494112015, -0.03669474273920059, 0.026669051498174667, -0.025997592136263847, 0.04708825424313545, 0.015465561300516129, -0.043845534324645996, 0.0106743685901165, 0.03248633071780205, 0.036660436540842056, -0.040803469717502594, 0.0037275180220603943, -0.026392651721835136, -0.041290055960416794, -0.0037052854895591736, 0.024322595447301865, 0.017938170582056046, 0.0484248511493206, -0.0166773684322834, 0.021647918969392776, 0.03978518024086952, -0.01167210191488266, 0.03842982277274132, -0.004018940031528473, -0.025866925716400146, 0.023645292967557907, 0.043949831277132034], [0.0256277434527874, 0.024334702640771866, 0.026090990751981735, -0.04488418251276016, 0.014863777905702591, 0.00566781684756279, -0.015182852745056152, 0.03432783856987953, -0.038937460631132126, -0.044450342655181885, 0.0017661340534687042, -0.021069740876555443, -0.0015721432864665985, -0.03342600166797638, 0.013848569244146347, 0.015082921832799911, 0.017933521419763565, -0.022751320153474808, -0.03857545927166939, -0.033791616559028625, -0.03218968212604523, -0.04064385965466499, 0.013807665556669235, -0.04664883762598038, -0.039494313299655914, 0.03311610594391823, 0.006724406033754349, 0.00816570594906807, -0.012141965329647064, 0.01368660107254982, -0.028622914105653763, 0.03437117114663124, 0.002356313169002533, -0.02295476198196411, 0.026994895190000534, -0.007294405251741409, 0.008702993392944336, -0.04354017972946167, 0.021096300333738327, -0.014945756644010544, 0.03118911013007164, -0.027438366785645485, 0.04013916477560997, 0.019847605377435684, 0.039178263396024704, 0.012188803404569626, -0.00012172386050224304, -0.03528466075658798, 0.041239093989133835, -0.0065631382167339325, -0.022832561284303665, -0.03991379588842392, -0.011264048516750336, -0.01032278686761856, 0.031075548380613327, 0.040322091430425644, -0.04224042966961861, 0.009816192090511322, 0.042932916432619095, 0.02548731490969658, -0.002919912338256836, 0.011011969298124313, 0.049237046390771866, -0.013446427881717682, 0.0023682713508605957, -0.0005621090531349182, 0.022164393216371536, 0.04615280404686928, 0.02161499485373497, 0.00012966245412826538, -0.04413510486483574, 0.010708402842283249, 0.022764351218938828, -0.026868904009461403, -0.03667259216308594, -0.027559412643313408, -0.033690690994262695, -0.001163732260465622, 0.04940358176827431, 0.010296713560819626, -0.0471477173268795, -0.006006110459566116, 0.04481092467904091, 0.041775453835725784, -0.030206073075532913, 0.04624629393219948, -0.003480173647403717, 0.037029895931482315, 0.036982957273721695, -0.0030478723347187042, 0.0022221915423870087, -0.00185399129986763, 0.049939606338739395, -0.005178369581699371, 0.04262515529990196, 0.04740921035408974, -0.039214134216308594, -0.01698392629623413, 0.015055585652589798, -0.022289646789431572, -0.017782140523195267, -0.043341923505067825, -0.009507320821285248, 0.02272893115878105, 0.022790852934122086, -0.027520036324858665, 0.017000149935483932, -0.03619736433029175, -0.026179814711213112, 0.007447350770235062, -0.004302285611629486, 0.02872166410088539, 0.006433594971895218, 0.010152578353881836, 0.017600547522306442, -0.037340737879276276, -0.00724414736032486, -0.03394665569067001, -0.011758912354707718, 0.02986724302172661, -0.038474880158901215, 0.01909109577536583, -0.04560723528265953, 0.028619732707738876, -0.03553454950451851, 0.00593169778585434, 0.03523002937436104, 0.04275694116950035], [0.034789372235536575, -0.006125986576080322, -0.008494008332490921, -0.018001042306423187, -0.0037885084748268127, 0.007143925875425339, -0.003288447856903076, -0.003171466290950775, 0.044464360922575, -0.03674659878015518, 0.009296558797359467, -0.017294060438871384, 0.0025948993861675262, 0.016868319362401962, 0.014937851577997208, -0.03850821405649185, -0.047534551471471786, -0.0299035906791687, 0.03280666843056679, -0.02732725255191326, -0.01002274826169014, 0.032315757125616074, -0.014895141124725342, 0.02559610828757286, -0.04489115625619888, 0.012075625360012054, -0.0038310401141643524, -0.008060503751039505, -0.04414169862866402, -0.046483397483825684, 0.002802230417728424, -0.0047744885087013245, 0.03438225015997887, 0.04804161563515663, -0.025236953049898148, 0.03619644418358803, 0.009208045899868011, -0.038906265050172806, 0.023080740123987198, 0.007583092898130417, 0.048895563930273056, -0.021585119888186455, 0.017595205456018448, 0.04842789098620415, -0.015497017651796341, 0.015522990375757217, -0.014325272291898727, -0.0031779631972312927, 0.02467658743262291, -0.011863600462675095, 0.048513080924749374, -0.03486461564898491, 0.020015086978673935, -0.030693089589476585, 0.033866677433252335, 0.025769535452127457, -0.04345560073852539, -0.035809777677059174, -0.01092994213104248, -0.0031953081488609314, -0.003380395472049713, -0.009910296648740768, -0.036361731588840485, 0.04046225920319557, -0.04698118194937706, 0.013232920318841934, 0.00921790674328804, -0.0023855678737163544, -0.01308208703994751, -0.004166591912508011, -0.001581978052854538, 0.04677614942193031, 0.003976486623287201, -0.03000549040734768, 0.03816812112927437, 0.011661790311336517, 0.038026776164770126, 0.04551437869668007, 0.010534204542636871, -0.019762372598052025, 0.011121071875095367, 0.014478612691164017, 0.03959336504340172, 0.0050092339515686035, 0.04908395931124687, -0.004609584808349609, -0.011102091521024704, 0.002773106098175049, -0.03424011543393135, -0.02492135763168335, 0.008848287165164948, 0.02032862976193428, -0.016016554087400436, -0.040194571018218994, -0.008291173726320267, -0.022465992718935013, -0.03589145094156265, 0.004140317440032959, 0.033324386924505234, -0.006365038454532623, 0.018028590828180313, 0.03825223818421364, -0.03250926733016968, -0.0317029133439064, -0.01933804713189602, -0.024770213291049004, -0.012486793100833893, 0.030041251331567764, 0.041229259222745895, 0.007612954825162888, -0.022277915850281715, 0.04239323362708092, -0.02053281106054783, 0.007252991199493408, -0.010478198528289795, -0.03106166236102581, 0.04679055139422417, 0.009256802499294281, -0.028760040178894997, 0.013261642307043076, 0.01579049602150917, -0.04036910459399223, 0.005450308322906494, -0.006902456283569336, -0.0033425576984882355, -0.013300765305757523, 0.03517918661236763, -0.008519135415554047], [-0.03209340572357178, -0.0498935841023922, 0.038391973823308945, 0.04228539392352104, 0.002618778496980667, -0.012161444872617722, 0.016779568046331406, -0.019174063578248024, 0.027692411094903946, 0.01378965750336647, -0.0032125115394592285, 0.016491379588842392, -0.021366477012634277, 0.03753993287682533, -0.01510704681277275, -0.003180883824825287, -0.03396972268819809, -0.04233631119132042, 0.04900587722659111, 0.007562898099422455, -0.014117073267698288, -0.011634398251771927, -0.0030662529170513153, 0.0021253451704978943, 0.004478119313716888, 0.005134511739015579, 0.027709294110536575, 0.0234810970723629, -0.024681473150849342, 0.0361432321369648, -0.047223784029483795, 0.03186626359820366, -0.01931394450366497, -0.03928334638476372, 0.042721737176179886, -0.011273063719272614, -0.02965179644525051, 0.03135187551379204, -0.03574768453836441, -0.014815222471952438, -0.04883132129907608, 0.003885328769683838, -0.025229383260011673, 0.036882784217596054, -0.026740992441773415, 0.033886853605508804, -0.026968229562044144, 0.019890639930963516, 0.046119894832372665, -0.015381108969449997, 0.045410607010126114, 0.006801534444093704, -0.024812817573547363, 0.032713402062654495, -0.033725738525390625, -0.047523416578769684, -0.04213785007596016, 0.025432419031858444, -0.01994328573346138, 0.019962940365076065, 0.04072487726807594, -0.0010557547211647034, -0.03323023393750191, 0.006543837487697601, 0.01624545082449913, -0.0014745481312274933, 0.01121283695101738, 0.03576160594820976, -0.043216537684202194, 0.01922372356057167, 0.018450167030096054, 0.025081444531679153, 0.022088181227445602, 0.006490983068943024, 0.04490481689572334, -0.002647172659635544, -0.02958214282989502, 0.026704121381044388, 0.014578495174646378, -0.040263425558805466, -0.009091269224882126, -0.024906635284423828, 0.010074175894260406, 0.04850616678595543, 0.017010699957609177, -0.018434155732393265, 0.03388958051800728, 0.018756020814180374, -0.041008055210113525, 0.03815409168601036, -0.025550080463290215, 0.023364435881376266, 0.03130561485886574, -0.0070684440433979034, 0.003228437155485153, 0.009795546531677246, -0.041435979306697845, -0.03513012081384659, -0.04174286127090454, 0.02974771335721016, -0.013251781463623047, -0.04099605232477188, -0.03697621822357178, 0.04054215922951698, -0.049034979194402695, -0.013781227171421051, -0.018138527870178223, 0.032594334334135056, -0.043943192809820175, -0.04399317502975464, 0.0008091330528259277, 0.02357366308569908, -0.04946444183588028, 0.03823680803179741, 0.017934445291757584, 0.026241552084684372, 0.003213129937648773, 0.04430133476853371, -0.00864950567483902, -0.029657412320375443, -0.025024831295013428, -0.031625617295503616, -0.005595743656158447, -0.040805984288454056, -0.019150614738464355, -0.02031913958489895, 0.03632761165499687, -0.003398168832063675], [0.011821459978818893, 0.048708345741033554, 0.006400443613529205, 0.024368081241846085, -0.014476180076599121, 0.015546787530183792, -0.014441452920436859, -0.04949551820755005, 0.01408768817782402, -0.0008990056812763214, -0.041568923741579056, 0.042600665241479874, 0.00755840539932251, 0.00602654367685318, 0.0012778528034687042, 0.0162958987057209, -0.03787188604474068, -0.02878936566412449, -0.02651587687432766, 0.0466107614338398, -0.003942526876926422, 0.02564939484000206, 0.028247181326150894, -0.02263893000781536, -0.04514219984412193, -0.04107009246945381, 0.04663905128836632, 0.009742237627506256, 0.04271901026368141, 0.04674457386136055, 0.017079781740903854, -0.03532760217785835, 0.04521901533007622, 0.0012570619583129883, -0.046504806727170944, 0.03039954975247383, -0.03869900852441788, -0.03321130573749542, 0.01286560669541359, -0.040532492101192474, 0.025135938078165054, -0.0037090182304382324, -0.005683399736881256, -0.007313549518585205, 0.015490006655454636, 0.04302370920777321, -0.04696209356188774, 0.03358068689703941, -0.014402590692043304, -0.014544345438480377, 0.0019442066550254822, 0.005884349346160889, 0.014818202704191208, -0.021632349118590355, -0.028520846739411354, -0.0037214159965515137, 0.02110041305422783, 0.024542856961488724, 0.004956495016813278, -0.03306686878204346, 0.016484174877405167, -0.028946006670594215, 0.045912984758615494, 0.038360487669706345, -0.008376561105251312, -0.0067934878170490265, 0.021335195749998093, 0.030412446707487106, -0.0034435391426086426, 0.0235624797642231, 0.004132963716983795, 0.02577674761414528, 0.016384784132242203, -0.016770638525485992, 0.0017098672688007355, -0.005463160574436188, -0.036481261253356934, 0.004243172705173492, -0.04657719284296036, 0.03172628954052925, -0.014543510973453522, -0.03764279931783676, -0.033218491822481155, 0.04414259269833565, -0.022180497646331787, 0.021213021129369736, 0.0469345785677433, -0.005613468587398529, -0.020474469289183617, 0.035783957690000534, 0.009437311440706253, -0.032080136239528656, 0.04579969868063927, -0.037636660039424896, -0.024735523387789726, -0.03933508321642876, -0.004881739616394043, -0.005493294447660446, 0.04318937286734581, 0.010071851313114166, -0.04536299780011177, -0.013076305389404297, -0.008912932127714157, -0.020976794883608818, 0.0298653282225132, -0.025535225868225098, 0.030287835747003555, -0.033872559666633606, 0.015894237905740738, 0.01882338896393776, 0.040995825082063675, -0.0054530128836631775, -0.03323493152856827, 0.03148392215371132, -0.007655404508113861, -0.01077575609087944, 0.033475760370492935, 0.017419110983610153, 0.008282888680696487, 0.009157240390777588, 0.011763371527194977, -0.04712803289294243, 0.04471926763653755, -0.0053937435150146484, 0.009255804121494293, 0.03986717388033867, 0.03055332973599434, 0.0309356190264225], [-0.0032459981739521027, 0.031294260174036026, -0.0006100758910179138, 0.014218781143426895, -0.01702141761779785, -0.014156579971313477, -0.01968569867312908, -0.044346120208501816, 0.025115255266427994, 0.03984462097287178, 0.0326913483440876, 0.015288304537534714, -0.015238702297210693, -0.026816463097929955, 0.04256553575396538, -0.004349730908870697, 0.023031268268823624, -0.018496833741664886, -0.038093484938144684, -0.023739362135529518, -0.043916668742895126, -0.027991129085421562, -0.020569002255797386, 0.028722498565912247, -0.017086803913116455, -0.013893507421016693, -0.02309807576239109, -0.024906421080231667, -0.03491983562707901, 0.0041409023106098175, -0.004397295415401459, 0.02983884885907173, -0.02382580004632473, 0.026318717747926712, 0.035510506480932236, 0.016392696648836136, -0.03445662185549736, 0.020300794392824173, 0.03211696073412895, 0.048701170831918716, -0.020234061405062675, -0.04474872350692749, -0.024222850799560547, -0.0423465371131897, -0.00472574308514595, 0.04035462066531181, -0.000936020165681839, 0.0019827112555503845, 0.018678318709135056, 0.031147722154855728, -0.003697894513607025, 0.04846762493252754, -0.00011751800775527954, -0.009570598602294922, 0.04629793390631676, -0.03278925269842148, 0.001833748072385788, -0.03680061176419258, 0.012282170355319977, 0.011404406279325485, 0.01427861675620079, 0.0026065483689308167, -0.02522815577685833, 0.015199851244688034, 0.027384404093027115, -0.025400960817933083, -0.006450902670621872, 0.007448028773069382, -0.04871981218457222, 0.003466390073299408, -0.020210636779665947, 0.015256833285093307, -0.04710710048675537, 0.00021554157137870789, 0.049001824110746384, -0.031460121273994446, -0.034604512155056, -0.01390545442700386, 0.005743242800235748, -0.010407529771327972, 0.007599055767059326, -0.009023882448673248, -0.03150266408920288, 0.0041456930339336395, 0.005612064152956009, -0.00843491405248642, 0.04430593177676201, 0.020682845264673233, 0.026879098266363144, -0.015365790575742722, -0.0015463344752788544, 0.0460883267223835, 0.009814728051424026, 0.007437430322170258, -0.01740056276321411, -0.028423083946108818, 0.048904094845056534, -0.015148710459470749, 0.004962801933288574, 0.04836864396929741, -0.047917354851961136, 0.0029820315539836884, 0.0001450665295124054, -0.005637954920530319, -0.027986109256744385, 0.043972406536340714, 0.03926766291260719, -0.04095267131924629, -0.03764991834759712, 0.024110201746225357, 0.0008021369576454163, 0.021790098398923874, 0.002878725528717041, -0.013134121894836426, -0.04081158712506294, -0.004283346235752106, 0.0033386722207069397, 0.036736343055963516, -0.01384890079498291, 0.02429947629570961, 0.04453739896416664, 0.04730404540896416, 0.010698996484279633, -0.03370280563831329, -0.03884533792734146, -0.02457038126885891, 0.04071691259741783, 0.03405698761343956], [-0.014607179909944534, 0.013878736644983292, 0.040736500173807144, 0.008357919752597809, -0.02066730335354805, -0.02039266936480999, -0.03246118873357773, 0.04956040158867836, 0.010282300412654877, 0.045456040650606155, -0.047063447535037994, -0.035346101969480515, -0.019892537966370583, 0.0434969998896122, -0.0314921960234642, 0.03073597326874733, 0.03859027847647667, -0.03852056339383125, 0.01492593064904213, -0.018743813037872314, 0.0475676991045475, -0.030780602246522903, 0.020942602306604385, -0.04429921135306358, -0.00038565322756767273, 0.038811925798654556, -0.02317195013165474, 0.0006462335586547852, -0.039445746690034866, -0.032626427710056305, 0.013475093990564346, 0.0310874842107296, -0.03503803163766861, 0.015029702335596085, -0.01355760172009468, -0.028550494462251663, 0.030378330498933792, 0.04960859939455986, -0.049336839467287064, 0.040116969496011734, 0.020811308175325394, 0.046889495104551315, 0.010222863405942917, -0.016683567315340042, -0.04872943088412285, 0.024792324751615524, 0.020736385136842728, 0.0038409456610679626, 0.04917427524924278, -0.02894604206085205, 0.03103720024228096, 0.04439425840973854, 0.021754886955022812, 0.015283096581697464, -0.014392711222171783, 0.03816348686814308, 0.033854398876428604, -0.04736737161874771, 0.007665716111660004, -0.034222424030303955, -0.021465850993990898, -0.01977590285241604, 0.046132851392030716, -0.00941605493426323, 0.003312431275844574, -0.04923420026898384, -0.028973115608096123, 0.019757915288209915, -0.026030361652374268, 0.03823516145348549, 0.03145882859826088, 0.044543538242578506, 0.020621273666620255, 1.4699995517730713e-05, 0.008580673485994339, -0.014548730105161667, -0.023198449984192848, -0.022957896813750267, 0.015184391289949417, 0.017959225922822952, -0.042401887476444244, 0.030088011175394058, -0.042292285710573196, 0.028151538223028183, 0.012344636023044586, 0.0006290562450885773, -0.01897357776761055, 0.0056161172688007355, -0.03627021238207817, -0.049269285053014755, 0.006943393498659134, 0.03465240076184273, 0.041358862072229385, 0.002047218382358551, 0.007926106452941895, 0.008624207228422165, 0.01535571739077568, 0.0402473546564579, 0.04200651869177818, -0.02894587628543377, 0.024988364428281784, 0.019900109618902206, 0.0011864788830280304, 0.009820915758609772, 0.044045839458703995, 0.0356895811855793, 0.005921900272369385, 0.024086978286504745, 0.007856488227844238, -0.046825479716062546, 0.02325012907385826, 0.0016458630561828613, -0.005503557622432709, 0.046920087188482285, -0.008887242525815964, -0.02391030825674534, 0.02418956533074379, 0.046359967440366745, 0.009980417788028717, 0.012128494679927826, 0.020204711705446243, 0.0027053579688072205, -0.028773844242095947, 0.02091849222779274, -0.03812968730926514, -0.02282644622027874, -0.010317016392946243, -0.0013609640300273895], [-0.014522157609462738, 0.0016194358468055725, 0.0010562911629676819, 0.016268301755189896, -0.01193232461810112, -0.027034569531679153, 0.01281454786658287, -0.02175825834274292, -0.03400605916976929, -0.01033785194158554, -0.012085415422916412, -0.003636907786130905, -0.04660656675696373, 0.009088315069675446, 0.01143181324005127, 0.019134346395730972, -0.017016924917697906, -0.019730079919099808, 0.009204257279634476, -0.001957140862941742, 0.025382351130247116, -0.02209559641778469, 0.0018940083682537079, 0.04723426327109337, -0.010715652257204056, 0.03754314407706261, 0.012519706040620804, -0.01892828941345215, 0.009148262441158295, 0.03918290510773659, 0.039869751781225204, 0.002154409885406494, -0.04180034250020981, -0.02750157192349434, -0.04868161678314209, 0.023368094116449356, -0.0037170760333538055, -0.00825798511505127, -0.03967873007059097, 0.029132332652807236, -0.0196885596960783, 0.0010815858840942383, 0.01985294744372368, 0.033115971833467484, -0.024280084297060966, -0.04902230575680733, -0.008269347250461578, -0.049656033515930176, 0.03091738000512123, 0.005829799920320511, 0.003075443208217621, -0.02461080625653267, 0.028419505804777145, 0.007528793066740036, -0.02476642094552517, -0.016332469880580902, 0.011431552469730377, 0.04582897201180458, -0.007418382912874222, 0.038353536278009415, -0.028607917949557304, 0.008694052696228027, 0.014568734914064407, 0.0319521464407444, -0.010394513607025146, 0.021498743444681168, -0.012212716042995453, 0.004904530942440033, 0.04901460185647011, -0.049121201038360596, 0.0038319118320941925, 0.03212691470980644, -0.02452942170202732, 0.011200286448001862, -0.04497262462973595, -0.004055846482515335, 0.012970421463251114, -0.02696859836578369, -0.033152177929878235, -0.045279789716005325, 0.021180201321840286, -0.03490227460861206, -0.046273112297058105, -0.005433369427919388, 0.048063013702631, -0.047067441046237946, -0.022578656673431396, 0.007372580468654633, -0.02843794785439968, -0.03772224113345146, -0.0006491541862487793, -0.017381954938173294, -0.0350617878139019, -0.0018025264143943787, 0.03739515319466591, 0.04092780128121376, 0.03361527994275093, -0.04972996935248375, -0.04101903364062309, 0.007265757769346237, -0.001272391527891159, -0.017180252820253372, -0.0279907938092947, -0.012770436704158783, 0.03720947727560997, 0.036120425909757614, 0.040434662252664566, -0.03779038041830063, 0.018530908972024918, 0.04111862555146217, 0.04154307767748833, -0.020733607932925224, 0.02753544971346855, 0.03398442640900612, 0.048412252217531204, 0.021233465522527695, 0.00269327312707901, -0.007127892225980759, 0.006643582135438919, 0.01919681951403618, -0.04821174219250679, -0.03354840353131294, 0.043216120451688766, -0.04626709222793579, 0.04974165931344032, -0.019086254760622978, -0.04428621754050255, 0.00447763130068779], [-0.03277941793203354, -0.02109544351696968, 0.034026969224214554, -0.03853071853518486, 0.04450995847582817, 0.049296651035547256, 0.0277947299182415, -0.014290355145931244, -0.038220763206481934, -0.02598722092807293, 0.022897783666849136, 0.0045469291508197784, 0.0021511688828468323, 0.011612903326749802, 0.0029381737112998962, 0.02608935907483101, 0.04720369353890419, -0.043671321123838425, -0.030312418937683105, -0.03860754892230034, 0.028558481484651566, -0.01862170547246933, -0.015906214714050293, 0.02720561996102333, -0.027179837226867676, 0.0018968693912029266, -0.01985849253833294, 0.028167758136987686, 0.0053322091698646545, -0.021708894520998, -0.014507174491882324, 0.026074383407831192, 0.01574714109301567, -0.03880791738629341, 0.04764855280518532, 0.01908315345644951, 0.03443504497408867, -0.03194582462310791, 0.0016119852662086487, -0.006133388727903366, 0.03478821739554405, -0.004826139658689499, -0.019103026017546654, 0.02585432305932045, 0.02951938286423683, -0.00328894704580307, -0.028665626421570778, -0.037700749933719635, -0.0021165013313293457, 0.04863417521119118, 0.049807045608758926, -0.021799838170409203, 0.011835061013698578, -0.03802754729986191, -0.019212936982512474, -0.04553420469164848, 0.04645862802863121, -0.033672548830509186, 0.0039041750133037567, -0.004366301000118256, -0.017219554632902145, -0.028419530019164085, 0.0269438736140728, 0.0006388425827026367, -0.03130926191806793, 0.027359772473573685, -0.009183954447507858, -0.014334417879581451, -0.014056872576475143, 0.006149351596832275, 0.00036967918276786804, 0.02582455798983574, 0.030705224722623825, -0.01890193298459053, 0.04264385625720024, 0.04865168407559395, -0.013055074959993362, -0.040743567049503326, -0.014816772192716599, 0.029721830040216446, 0.014080557972192764, -0.0040847547352313995, -0.012758124619722366, -0.03091125562787056, -0.029484355822205544, -0.0483502522110939, -0.014734946191310883, 0.012098323553800583, -0.042596518993377686, 0.03409156575798988, -0.0492023229598999, 0.0029258616268634796, -0.03696489334106445, 0.04970302805304527, 0.04547799751162529, 0.024252723902463913, 0.012311886996030807, 0.020202461630105972, 0.014046262949705124, 0.024002742022275925, -0.02130495384335518, 0.02918502315878868, -0.01882852427661419, 0.0002499818801879883, 0.041822243481874466, 0.03466219827532768, -0.032121360301971436, -0.014443647116422653, -0.003911398351192474, -0.004608619958162308, -0.03627902269363403, 0.02156095579266548, -0.007306944578886032, -0.0407620444893837, -0.012764118611812592, 0.03516257926821709, 0.011560045182704926, 0.024447370320558548, 0.047540996223688126, 0.04321197047829628, -0.02001866139471531, 0.022211384028196335, -0.0069047436118125916, 0.048507582396268845, 0.04377606883645058, -0.010533642023801804, 0.03798750415444374, -0.04052599519491196], [0.01205819845199585, -0.004686497151851654, 0.004676103591918945, 0.03997478261590004, 0.027893412858247757, 0.02641589567065239, 0.040611933916807175, 0.04188814386725426, 0.031286802142858505, 0.029850807040929794, -0.03106372430920601, 0.04746894910931587, 0.0034919604659080505, -0.007838856428861618, 0.044622328132390976, 0.03180661424994469, -0.03725303336977959, -0.038970135152339935, -0.03873777389526367, 0.04214760288596153, 0.032216157764196396, 0.0030709020793437958, -0.0010089278221130371, 0.03697798028588295, -0.03996846824884415, 0.010756660252809525, -0.00839003175497055, -0.01978062465786934, 0.04810898378491402, -0.03886014223098755, 0.020264532417058945, 0.04346071556210518, 0.024040136486291885, -0.007432948797941208, -0.026528572663664818, 0.033416930586099625, 0.02505427971482277, -0.02180321328341961, -0.040910374373197556, -0.013879656791687012, -0.037348855286836624, -0.03994486480951309, 0.028804961591959, 0.03387366607785225, -0.02496117353439331, -0.04777548462152481, 0.0030387043952941895, 0.04276169463992119, -0.03743750974535942, 0.02062029018998146, -0.03274552896618843, -0.044375766068696976, -0.018656112253665924, 0.04356945678591728, 0.030669163912534714, 0.022129181772470474, 0.026983406394720078, -0.0006590113043785095, -0.008954845368862152, 0.019636142998933792, -0.033044375479221344, 0.04545462504029274, 0.03849048539996147, 0.015690136700868607, 0.045540761202573776, -7.939338684082031e-05, -0.028091227635741234, 0.0011224746704101562, -0.03915365785360336, -0.04909675195813179, 0.029668856412172318, -0.03441140800714493, -0.00010397285223007202, 0.030019212514162064, 0.014986824244260788, 